misc/perf-test/results/clickhouse_constant-query.txt
This is ApacheBench, Version 2.3 <$Revision: 1430300 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking ch-server (be patient)


Server Software:        
Server Hostname:        ch-server
Server Port:            8123

Document Path:          /?query=select%20%1
Document Length:        182 bytes

Concurrency Level:      20
Time taken for tests:   797.775 seconds
Complete requests:      100000
Failed requests:        0
Write errors:           0
Non-2xx responses:      100000
Total transferred:      39700000 bytes
HTML transferred:       18200000 bytes
Requests per second:    125.35 [#/sec] (mean)
Time per request:       159.555 [ms] (mean)
Time per request:       7.978 [ms] (mean, across all concurrent requests)
Transfer rate:          48.60 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0  156 365.8      1    1062
Processing:     1    3   1.8      3      48
Waiting:        1    3   1.7      2      48
Total:          1  159 366.7      4    1077

Percentage of the requests served within a certain time (ms)
  50%      4
  66%      5
  75%      6
  80%      7
  90%   1023
  95%   1025
  98%   1027
  99%   1029
 100%   1077 (longest request)