misc/perf-test/results/clickhouse_url(jdbc-bridge).txt
This is ApacheBench, Version 2.3 <$Revision: 1430300 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking ch-server (be patient)


Server Software:        
Server Hostname:        ch-server
Server Port:            8123

Document Path:          /?query=select%20%2A%20from%20url%28%27http%3A%2F%2Fjdbc-bridge%3A9019%2Fping%27%2C%20CSV%2C%20%27result%20String%27%29
Document Length:        4 bytes

Concurrency Level:      20
Time taken for tests:   811.299 seconds
Complete requests:      100000
Failed requests:        446
   (Connect: 0, Receive: 0, Length: 446, Exceptions: 0)
Write errors:           0
Non-2xx responses:      446
Total transferred:      42623638 bytes
HTML transferred:       461548 bytes
Requests per second:    123.26 [#/sec] (mean)
Time per request:       162.260 [ms] (mean)
Time per request:       8.113 [ms] (mean, across all concurrent requests)
Transfer rate:          51.31 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0  147 356.4      1    3053
Processing:     3   15  69.7      9    1032
Waiting:        2   14  69.8      8    1032
Total:          3  162 375.4     10    3066

Percentage of the requests served within a certain time (ms)
  50%     10
  66%     12
  75%     14
  80%     15
  90%   1022
  95%   1026
  98%   1029
  99%   1034
 100%   3066 (longest request)